import { ModalTooltip } from "@/app/components/tooltip/tooltip";
import { Tesis } from "../slides/thesis/block";
import Link from "next/link";

export const thesesList: Tesis[] = [
    {
        capture: "Финансы",
        description: <>
            Получайте еженедельные отчёты о движении финансов вашего предприятия. <br />
            Планируйте выплату кредитных обязательств, сокращайте кассовые разрывы и контролируйте выплаты сотрудникам.
        </>
    },
    {
        capture: "Сотрудники",
        description: <>
            Сотрудник <ModalTooltip content='Мы используем систему двойной идентичности сотрудников - управление может быть под контролем менеджера, без необходимости явного приглашения сотрудников в систему.'><span style={{cursor: 'pointer', color: 'var(--color-text-hint)'}}>не обязан иметь аккаунт</span></ModalTooltip>, чтобы участвовать в отчетности компании. 
            Стройте графики рабочих часов, отслеживайте активность сотрудников, планируйте зарплатные выплаты и поощрения за выполненную работу.
        </>
    },
    {
        capture: "Услуги & Склад",
        description: <>
            Структуризуйте ассортимент услуг/товаров вашего предприятия с возможностью регулярной выгрузки с помощью нашего открытого <Link href='/dev' style={{color: 'var(--color-text-hint)'}}>API</Link>. <br />
            Настраивайте сезонные скидки, акции и рассылки о предложениях.<br /><br />
            <ModalTooltip content='Цифровые лицензии, материальные товары любой специфики: агрегаты, запчасти, фабричные изделия.'><span style={{color: 'var(--color-text-hint)', cursor: 'pointer'}}>*товары и продукты любого вида</span></ModalTooltip>
        </>
    },
    {
        capture: "Клиенты",
        description: <>
            Перенесите клиентскую базу в защищённое хранилище Kroncl.
            Ведите индивидуальную историю клиентов, используйте инструменты повторого привлечения для повышения показателей удержания клиента. 
        </>
    },
    {
        capture: "Сделки",
        description: <>
            Создание сделок с автоматическим созданием/привязкой клиентов, загрузкой ассортимента услуг и товаров в состав сделки. <br />
            Гибкое планирование будущих продаж, интеграция с модулем финансов.
        </>
    },
    {
        capture: "Логистика",
        description: <>
            Контроль исходящих и поступающих товаров. Графики отправок, уведомления в день поступления. <br />
            Учёт затрат на услуги логистических компаний, сквозная интеграция с финансами.
        </>
    }
]